betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_tmr.h
  uint32_t OSSIState;            /*!< Specifies the Off-State used in Idle state.
                                      This parameter can be a value of @ref TMR_DDL_EC_OSSI

                                      This feature can be modified afterwards using unitary function
                                      @ref DDL_TMR_SetOffStates()

                                      @note This bit-field cannot be modified as long as LOCK level 2 has been
                                      programmed. */

  uint32_t LockLevel;            /*!< Specifies the LOCK level parameters.
                                      This parameter can be a value of @ref TMR_DDL_EC_LOCKLEVEL

                                      @note The LOCK bits can be written only once after the reset. Once the TMRx_BDTR
                                      register has been written, their content is frozen until the next reset.*/

  uint8_t DeadTime;              /*!< Specifies the delay time between the switching-off and the
                                      switching-on of the outputs.
                                      This parameter can be a number between Min_Data = 0x00 and Max_Data = 0xFF.

                                      This feature can be modified afterwards using unitary function
                                      @ref DDL_TMR_OC_SetDeadTime()

                                      @note This bit-field can not be modified as long as LOCK level 1, 2 or 3 has been
                                       programmed. */

  uint16_t BreakState;           /*!< Specifies whether the TMR Break input is enabled or not.
                                      This parameter can be a value of @ref TMR_DDL_EC_BREAK_ENABLE

                                      This feature can be modified afterwards using unitary functions
                                      @ref DDL_TMR_EnableBRK() or @ref DDL_TMR_DisableBRK()

                                      @note This bit-field can not be modified as long as LOCK level 1 has been
                                      programmed. */

  uint32_t BreakPolarity;        /*!< Specifies the TMR Break Input pin polarity.
                                      This parameter can be a value of @ref TMR_DDL_EC_BREAK_POLARITY

                                      This feature can be modified afterwards using unitary function
                                      @ref DDL_TMR_ConfigBRK()

                                      @note This bit-field can not be modified as long as LOCK level 1 has been
                                      programmed. */

  uint32_t AutomaticOutput;      /*!< Specifies whether the TMR Automatic Output feature is enabled or not.
                                      This parameter can be a value of @ref TMR_DDL_EC_AUTOMATICOUTPUT_ENABLE

                                      This feature can be modified afterwards using unitary functions
                                      @ref DDL_TMR_EnableAutomaticOutput() or @ref DDL_TMR_DisableAutomaticOutput()

                                      @note This bit-field can not be modified as long as LOCK level 1 has been
                                      programmed. */
} DDL_TMR_BDT_InitTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup TMR_DDL_Exported_Constants TMR Exported Constants
  * @{
  */

/** @defgroup TMR_DDL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with DDL_TMR_ReadReg function.
  * @{
  */
#define DDL_TMR_STS_UIFLG                          TMR_STS_UIFLG           /*!< Update interrupt flag */
#define DDL_TMR_STS_CC1IFLG                        TMR_STS_CC1IFLG         /*!< Capture/compare 1 interrupt flag */
#define DDL_TMR_STS_CC2IFLG                        TMR_STS_CC2IFLG         /*!< Capture/compare 2 interrupt flag */
#define DDL_TMR_STS_CC3IFLG                        TMR_STS_CC3IFLG         /*!< Capture/compare 3 interrupt flag */
#define DDL_TMR_STS_CC4IFLG                        TMR_STS_CC4IFLG         /*!< Capture/compare 4 interrupt flag */
#define DDL_TMR_STS_COMIFLG                        TMR_STS_COMIFLG         /*!< COM interrupt flag */
#define DDL_TMR_STS_TRGIFLG                        TMR_STS_TRGIFLG         /*!< Trigger interrupt flag */
#define DDL_TMR_STS_BRKIFLG                        TMR_STS_BRKIFLG         /*!< Break interrupt flag */
#define DDL_TMR_STS_CC1RCFLG                       TMR_STS_CC1RCFLG        /*!< Capture/Compare 1 overcapture flag */
#define DDL_TMR_STS_CC2RCFLG                       TMR_STS_CC2RCFLG        /*!< Capture/Compare 2 overcapture flag */
#define DDL_TMR_STS_CC3RCFLG                       TMR_STS_CC3RCFLG        /*!< Capture/Compare 3 overcapture flag */
#define DDL_TMR_STS_CC4RCFLG                       TMR_STS_CC4RCFLG        /*!< Capture/Compare 4 overcapture flag */
/**
  * @}
  */

#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup TMR_DDL_EC_BREAK_ENABLE Break Enable
  * @{
  */
#define DDL_TMR_BREAK_DISABLE            0x00000000U             /*!< Break function disabled */
#define DDL_TMR_BREAK_ENABLE             TMR_BDT_BRKEN            /*!< Break function enabled */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_AUTOMATICOUTPUT_ENABLE Automatic output enable
  * @{
  */
#define DDL_TMR_AUTOMATICOUTPUT_DISABLE         0x00000000U             /*!< MOE can be set only by software */
#define DDL_TMR_AUTOMATICOUTPUT_ENABLE          TMR_BDT_AOEN            /*!< MOE can be set by software or automatically at the next update event */
/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/** @defgroup TMR_DDL_EC_IT IT Defines
  * @brief    IT defines which can be used with DDL_TMR_ReadReg and  DDL_TMR_WriteReg functions.
  * @{
  */
#define DDL_TMR_DIEN_UIEN                        TMR_DIEN_UIEN         /*!< Update interrupt enable */
#define DDL_TMR_DIEN_CC1IEN                      TMR_DIEN_CC1IEN       /*!< Capture/compare 1 interrupt enable */
#define DDL_TMR_DIEN_CC2IEN                      TMR_DIEN_CC2IEN       /*!< Capture/compare 2 interrupt enable */
#define DDL_TMR_DIEN_CC3IEN                      TMR_DIEN_CC3IEN       /*!< Capture/compare 3 interrupt enable */
#define DDL_TMR_DIEN_CC4IEN                      TMR_DIEN_CC4IEN       /*!< Capture/compare 4 interrupt enable */
#define DDL_TMR_DIEN_COMIEN                      TMR_DIEN_COMIEN       /*!< COM interrupt enable */
#define DDL_TMR_DIEN_TRGIEN                      TMR_DIEN_TRGIEN       /*!< Trigger interrupt enable */
#define DDL_TMR_DIEN_BRKIEN                      TMR_DIEN_BRKIEN       /*!< Break interrupt enable */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_UPDATESOURCE Update Source
  * @{
  */
#define DDL_TMR_UPDATESOURCE_REGULAR            0x00000000U          /*!< Counter overflow/underflow, Setting the UG bit or Update generation through the slave mode controller generates an update request */
#define DDL_TMR_UPDATESOURCE_COUNTER            TMR_CTRL1_URSSEL          /*!< Only counter overflow/underflow generates an update request */
/**
  * @}
  */

