betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_tmr.h
/** @defgroup TMR_DDL_EC_ONEPULSEMODE One Pulse Mode
  * @{
  */
#define DDL_TMR_ONEPULSEMODE_SINGLE             TMR_CTRL1_SPMEN          /*!< Counter stops counting at the next update event */
#define DDL_TMR_ONEPULSEMODE_REPETITIVE         0x00000000U          /*!< Counter is not stopped at update event */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_COUNTERMODE Counter Mode
  * @{
  */
#define DDL_TMR_COUNTERMODE_UP                  0x00000000U               /*!<Counter used as upcounter */
#define DDL_TMR_COUNTERMODE_DOWN                TMR_CTRL1_CNTDIR          /*!< Counter used as downcounter */
#define DDL_TMR_COUNTERMODE_CENTER_DOWN         TMR_CTRL1_CAMSEL_0        /*!< The counter counts up and down alternatively. Output compare interrupt flags of output channels  are set only when the counter is counting down. */
#define DDL_TMR_COUNTERMODE_CENTER_UP           TMR_CTRL1_CAMSEL_1        /*!<The counter counts up and down alternatively. Output compare interrupt flags of output channels  are set only when the counter is counting up */
#define DDL_TMR_COUNTERMODE_CENTER_UP_DOWN      TMR_CTRL1_CAMSEL          /*!< The counter counts up and down alternatively. Output compare interrupt flags of output channels  are set only when the counter is counting up or down. */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_CLOCKDIVISION Clock Division
  * @{
  */
#define DDL_TMR_CLOCKDIVISION_DIV1              0x00000000U               /*!< tDTS=tCK_INT */
#define DDL_TMR_CLOCKDIVISION_DIV2              TMR_CTRL1_CLKDIV_0        /*!< tDTS=2*tCK_INT */
#define DDL_TMR_CLOCKDIVISION_DIV4              TMR_CTRL1_CLKDIV_1        /*!< tDTS=4*tCK_INT */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_COUNTERDIRECTION Counter Direction
  * @{
  */
#define DDL_TMR_COUNTERDIRECTION_UP             0x00000000U               /*!< Timer counter counts up */
#define DDL_TMR_COUNTERDIRECTION_DOWN           TMR_CTRL1_CNTDIR          /*!< Timer counter counts down */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_CCUPDATESOURCE Capture Compare  Update Source
  * @{
  */
#define DDL_TMR_CCUPDATESOURCE_COMG_ONLY        0x00000000U              /*!< Capture/compare control bits are updated by setting the COMG bit only */
#define DDL_TMR_CCUPDATESOURCE_COMG_AND_TRGI    TMR_CTRL2_CCUSEL         /*!< Capture/compare control bits are updated by setting the COMG bit or when a rising edge occurs on trigger input (TRGI) */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_CCDMAREQUEST Capture Compare DMA Request
  * @{
  */
#define DDL_TMR_CCDMAREQUEST_CC                 0x00000000U              /*!< CCx DMA request sent when CCx event occurs */
#define DDL_TMR_CCDMAREQUEST_UPDATE             TMR_CTRL2_CCDSEL         /*!< CCx DMA requests sent when update event occurs */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_LOCKLEVEL Lock Level
  * @{
  */
#define DDL_TMR_LOCKLEVEL_OFF                   0x00000000U            /*!< LOCK OFF - No bit is write protected */
#define DDL_TMR_LOCKLEVEL_1                     TMR_BDT_LOCKCFG_0      /*!< LOCK Level 1 */
#define DDL_TMR_LOCKLEVEL_2                     TMR_BDT_LOCKCFG_1      /*!< LOCK Level 2 */
#define DDL_TMR_LOCKLEVEL_3                     TMR_BDT_LOCKCFG        /*!< LOCK Level 3 */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_CHANNEL Channel
  * @{
  */
#define DDL_TMR_CHANNEL_CH1                     TMR_CCEN_CC1EN     /*!< Timer input/output channel 1 */
#define DDL_TMR_CHANNEL_CH1N                    TMR_CCEN_CC1NEN    /*!< Timer complementary output channel 1 */
#define DDL_TMR_CHANNEL_CH2                     TMR_CCEN_CC2EN     /*!< Timer input/output channel 2 */
#define DDL_TMR_CHANNEL_CH2N                    TMR_CCEN_CC2NEN    /*!< Timer complementary output channel 2 */
#define DDL_TMR_CHANNEL_CH3                     TMR_CCEN_CC3EN     /*!< Timer input/output channel 3 */
#define DDL_TMR_CHANNEL_CH3N                    TMR_CCEN_CC3NEN    /*!< Timer complementary output channel 3 */
#define DDL_TMR_CHANNEL_CH4                     TMR_CCEN_CC4EN     /*!< Timer input/output channel 4 */
/**
  * @}
  */

#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup TMR_DDL_EC_OCSTATE Output Configuration State
  * @{
  */
#define DDL_TMR_OCSTATE_DISABLE                 0x00000000U              /*!< OCx is not active */
#define DDL_TMR_OCSTATE_ENABLE                  TMR_CCEN_CC1EN           /*!< OCx signal is output on the corresponding output pin */
/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/** @defgroup TMR_DDL_EC_OCMODE Output Configuration Mode
  * @{
  */
#define DDL_TMR_OCMODE_FROZEN                   0x00000000U                                                 /*!<The comparison between the output compare register TMRx_CCRy and the counter TMRx_CNT has no effect on the output channel level */
#define DDL_TMR_OCMODE_ACTIVE                   TMR_CCM1_OC1MOD_0                                           /*!<OCyREF is forced high on compare match*/
#define DDL_TMR_OCMODE_INACTIVE                 TMR_CCM1_OC1MOD_1                                           /*!<OCyREF is forced low on compare match*/
#define DDL_TMR_OCMODE_TOGGLE                   (TMR_CCM1_OC1MOD_1 | TMR_CCM1_OC1MOD_0)                     /*!<OCyREF toggles on compare match*/
#define DDL_TMR_OCMODE_FORCED_INACTIVE          TMR_CCM1_OC1MOD_2                                           /*!<OCyREF is forced low*/
#define DDL_TMR_OCMODE_FORCED_ACTIVE            (TMR_CCM1_OC1MOD_2 | TMR_CCM1_OC1MOD_0)                     /*!<OCyREF is forced high*/
#define DDL_TMR_OCMODE_PWM1                     (TMR_CCM1_OC1MOD_2 | TMR_CCM1_OC1MOD_1)                     /*!<In upcounting, channel y is active as long as TMRx_CNT<TMRx_CCRy else inactive.  In downcounting, channel y is inactive as long as TMRx_CNT>TMRx_CCRy else active.*/
#define DDL_TMR_OCMODE_PWM2                     (TMR_CCM1_OC1MOD_2 | TMR_CCM1_OC1MOD_1 | TMR_CCM1_OC1MOD_0) /*!<In upcounting, channel y is inactive as long as TMRx_CNT<TMRx_CCRy else active.  In downcounting, channel y is active as long as TMRx_CNT>TMRx_CCRy else inactive*/
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_OCPOLARITY Output Configuration Polarity
  * @{
  */
#define DDL_TMR_OCPOLARITY_HIGH                 0x00000000U                   /*!< OCxactive high*/
#define DDL_TMR_OCPOLARITY_LOW                  TMR_CCEN_CC1POL               /*!< OCxactive low*/
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_OCIDLESTATE Output Configuration Idle State
  * @{
  */
#define DDL_TMR_OCIDLESTATE_LOW                 0x00000000U                 /*!<OCx=0 (after a dead-time if OC is implemented) when MOE=0*/
#define DDL_TMR_OCIDLESTATE_HIGH                TMR_CTRL2_OC1OIS            /*!<OCx=1 (after a dead-time if OC is implemented) when MOE=0*/
/**
  * @}
  */


/** @defgroup TMR_DDL_EC_ACTIVEINPUT Active Input Selection
  * @{
  */
#define DDL_TMR_ACTIVEINPUT_DIRECTTI            (TMR_CCM1_CC1SEL_0 << 16U) /*!< ICx is mapped on TIx */
#define DDL_TMR_ACTIVEINPUT_INDIRECTTI          (TMR_CCM1_CC1SEL_1 << 16U) /*!< ICx is mapped on TIy */
#define DDL_TMR_ACTIVEINPUT_TRC                 (TMR_CCM1_CC1SEL << 16U)   /*!< ICx is mapped on TRC */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_ICPSC Input Configuration Prescaler
  * @{
  */
#define DDL_TMR_ICPSC_DIV1                      0x00000000U                   /*!< No prescaler, capture is done each time an edge is detected on the capture input */
#define DDL_TMR_ICPSC_DIV2                      (TMR_CCM1_IC1PSC_0 << 16U)    /*!< Capture is done once every 2 events */
#define DDL_TMR_ICPSC_DIV4                      (TMR_CCM1_IC1PSC_1 << 16U)    /*!< Capture is done once every 4 events */
#define DDL_TMR_ICPSC_DIV8                      (TMR_CCM1_IC1PSC << 16U)      /*!< Capture is done once every 8 events */
/**
  * @}
  */

