betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_tmr.h
/** @defgroup TMR_DDL_EC_IC_FILTER Input Configuration Filter
  * @{
  */
#define DDL_TMR_IC_FILTER_FDIV1                 0x00000000U                                                       /*!< No filter, sampling is done at fDTS */
#define DDL_TMR_IC_FILTER_FDIV1_N2              (TMR_CCM1_IC1F_0 << 16U)                                          /*!< fSAMPLING=fCK_INT, N=2 */
#define DDL_TMR_IC_FILTER_FDIV1_N4              (TMR_CCM1_IC1F_1 << 16U)                                          /*!< fSAMPLING=fCK_INT, N=4 */
#define DDL_TMR_IC_FILTER_FDIV1_N8              ((TMR_CCM1_IC1F_1 | TMR_CCM1_IC1F_0) << 16U)                      /*!< fSAMPLING=fCK_INT, N=8 */
#define DDL_TMR_IC_FILTER_FDIV2_N6              (TMR_CCM1_IC1F_2 << 16U)                                          /*!< fSAMPLING=fDTS/2, N=6 */
#define DDL_TMR_IC_FILTER_FDIV2_N8              ((TMR_CCM1_IC1F_2 | TMR_CCM1_IC1F_0) << 16U)                      /*!< fSAMPLING=fDTS/2, N=8 */
#define DDL_TMR_IC_FILTER_FDIV4_N6              ((TMR_CCM1_IC1F_2 | TMR_CCM1_IC1F_1) << 16U)                      /*!< fSAMPLING=fDTS/4, N=6 */
#define DDL_TMR_IC_FILTER_FDIV4_N8              ((TMR_CCM1_IC1F_2 | TMR_CCM1_IC1F_1 | TMR_CCM1_IC1F_0) << 16U)    /*!< fSAMPLING=fDTS/4, N=8 */
#define DDL_TMR_IC_FILTER_FDIV8_N6              (TMR_CCM1_IC1F_3 << 16U)                                          /*!< fSAMPLING=fDTS/8, N=6 */
#define DDL_TMR_IC_FILTER_FDIV8_N8              ((TMR_CCM1_IC1F_3 | TMR_CCM1_IC1F_0) << 16U)                      /*!< fSAMPLING=fDTS/8, N=8 */
#define DDL_TMR_IC_FILTER_FDIV16_N5             ((TMR_CCM1_IC1F_3 | TMR_CCM1_IC1F_1) << 16U)                      /*!< fSAMPLING=fDTS/16, N=5 */
#define DDL_TMR_IC_FILTER_FDIV16_N6             ((TMR_CCM1_IC1F_3 | TMR_CCM1_IC1F_1 | TMR_CCM1_IC1F_0) << 16U)    /*!< fSAMPLING=fDTS/16, N=6 */
#define DDL_TMR_IC_FILTER_FDIV16_N8             ((TMR_CCM1_IC1F_3 | TMR_CCM1_IC1F_2) << 16U)                      /*!< fSAMPLING=fDTS/16, N=8 */
#define DDL_TMR_IC_FILTER_FDIV32_N5             ((TMR_CCM1_IC1F_3 | TMR_CCM1_IC1F_2 | TMR_CCM1_IC1F_0) << 16U)    /*!< fSAMPLING=fDTS/32, N=5 */
#define DDL_TMR_IC_FILTER_FDIV32_N6             ((TMR_CCM1_IC1F_3 | TMR_CCM1_IC1F_2 | TMR_CCM1_IC1F_1) << 16U)    /*!< fSAMPLING=fDTS/32, N=6 */
#define DDL_TMR_IC_FILTER_FDIV32_N8             (TMR_CCM1_IC1F << 16U)                                            /*!< fSAMPLING=fDTS/32, N=8 */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_IC_POLARITY Input Configuration Polarity
  * @{
  */
#define DDL_TMR_IC_POLARITY_RISING              0x00000000U                          /*!< The circuit is sensitive to TIxFP1 rising edge, TIxFP1 is not inverted */
#define DDL_TMR_IC_POLARITY_FALLING             TMR_CCEN_CC1POL                      /*!< The circuit is sensitive to TIxFP1 falling edge, TIxFP1 is inverted */
#define DDL_TMR_IC_POLARITY_BOTHEDGE            (TMR_CCEN_CC1POL | TMR_CCEN_CC1NPOL) /*!< The circuit is sensitive to both TIxFP1 rising and falling edges, TIxFP1 is not inverted */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_CLOCKSOURCE Clock Source
  * @{
  */
#define DDL_TMR_CLOCKSOURCE_INTERNAL            0x00000000U                                                         /*!< The timer is clocked by the internal clock provided from the RCC */
#define DDL_TMR_CLOCKSOURCE_EXT_MODE1           (TMR_SMCTRL_SMFSEL_2 | TMR_SMCTRL_SMFSEL_1 | TMR_SMCTRL_SMFSEL_0)   /*!< Counter counts at each rising or falling edge on a selected input*/
#define DDL_TMR_CLOCKSOURCE_EXT_MODE2           TMR_SMCTRL_ECEN                                                     /*!< Counter counts at each rising or falling edge on the external trigger input ETR */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_ENCODERMODE Encoder Mode
  * @{
  */
#define DDL_TMR_ENCODERMODE_X2_TI1                     TMR_SMCTRL_SMFSEL_0                                                     /*!< Quadrature encoder mode 1, x2 mode - Counter counts up/down on TI1FP1 edge depending on TI2FP2 level */
#define DDL_TMR_ENCODERMODE_X2_TI2                     TMR_SMCTRL_SMFSEL_1                                                     /*!< Quadrature encoder mode 2, x2 mode - Counter counts up/down on TI2FP2 edge depending on TI1FP1 level */
#define DDL_TMR_ENCODERMODE_X4_TI12                   (TMR_SMCTRL_SMFSEL_1 | TMR_SMCTRL_SMFSEL_0)                              /*!< Quadrature encoder mode 3, x4 mode - Counter counts up/down on both TI1FP1 and TI2FP2 edges depending on the level of the other input */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_TRGO Trigger Output
  * @{
  */
#define DDL_TMR_TRGO_RESET                      0x00000000U                                                 /*!< UG bit from the TMRx_EGR register is used as trigger output */
#define DDL_TMR_TRGO_ENABLE                     TMR_CTRL2_MMSEL_0                                           /*!< Counter Enable signal (CNT_EN) is used as trigger output */
#define DDL_TMR_TRGO_UPDATE                     TMR_CTRL2_MMSEL_1                                           /*!< Update event is used as trigger output */
#define DDL_TMR_TRGO_CC1IF                      (TMR_CTRL2_MMSEL_1 | TMR_CTRL2_MMSEL_0)                     /*!< CC1 capture or a compare match is used as trigger output */
#define DDL_TMR_TRGO_OC1REF                     TMR_CTRL2_MMSEL_2                                           /*!< OC1REF signal is used as trigger output */
#define DDL_TMR_TRGO_OC2REF                     (TMR_CTRL2_MMSEL_2 | TMR_CTRL2_MMSEL_0)                     /*!< OC2REF signal is used as trigger output */
#define DDL_TMR_TRGO_OC3REF                     (TMR_CTRL2_MMSEL_2 | TMR_CTRL2_MMSEL_1)                     /*!< OC3REF signal is used as trigger output */
#define DDL_TMR_TRGO_OC4REF                     (TMR_CTRL2_MMSEL_2 | TMR_CTRL2_MMSEL_1 | TMR_CTRL2_MMSEL_0) /*!< OC4REF signal is used as trigger output */
/**
  * @}
  */


/** @defgroup TMR_DDL_EC_SLAVEMODE Slave Mode
  * @{
  */
#define DDL_TMR_SLAVEMODE_DISABLED              0x00000000U                                   /*!< Slave mode disabled */
#define DDL_TMR_SLAVEMODE_RESET                 TMR_SMCTRL_SMFSEL_2                           /*!< Reset Mode - Rising edge of the selected trigger input (TRGI) reinitializes the counter */
#define DDL_TMR_SLAVEMODE_GATED                 (TMR_SMCTRL_SMFSEL_2 | TMR_SMCTRL_SMFSEL_0)   /*!< Gated Mode - The counter clock is enabled when the trigger input (TRGI) is high */
#define DDL_TMR_SLAVEMODE_TRIGGER               (TMR_SMCTRL_SMFSEL_2 | TMR_SMCTRL_SMFSEL_1)   /*!< Trigger Mode - The counter starts at a rising edge of the trigger TRGI */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_TS Trigger Selection
  * @{
  */
#define DDL_TMR_TS_ITR0                         0x00000000U                                                           /*!< Internal Trigger 0 (ITR0) is used as trigger input */
#define DDL_TMR_TS_ITR1                         TMR_SMCTRL_TRGSEL_0                                                   /*!< Internal Trigger 1 (ITR1) is used as trigger input */
#define DDL_TMR_TS_ITR2                         TMR_SMCTRL_TRGSEL_1                                                   /*!< Internal Trigger 2 (ITR2) is used as trigger input */
#define DDL_TMR_TS_ITR3                         (TMR_SMCTRL_TRGSEL_0 | TMR_SMCTRL_TRGSEL_1)                           /*!< Internal Trigger 3 (ITR3) is used as trigger input */
#define DDL_TMR_TS_TI1F_ED                      TMR_SMCTRL_TRGSEL_2                                                   /*!< TI1 Edge Detector (TI1F_ED) is used as trigger input */
#define DDL_TMR_TS_TI1FP1                       (TMR_SMCTRL_TRGSEL_2 | TMR_SMCTRL_TRGSEL_0)                           /*!< Filtered Timer Input 1 (TI1FP1) is used as trigger input */
#define DDL_TMR_TS_TI2FP2                       (TMR_SMCTRL_TRGSEL_2 | TMR_SMCTRL_TRGSEL_1)                           /*!< Filtered Timer Input 2 (TI12P2) is used as trigger input */
#define DDL_TMR_TS_ETRF                         (TMR_SMCTRL_TRGSEL_2 | TMR_SMCTRL_TRGSEL_1 | TMR_SMCTRL_TRGSEL_0)     /*!< Filtered external Trigger (ETRF) is used as trigger input */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_ETR_POLARITY External Trigger Polarity
  * @{
  */
#define DDL_TMR_ETR_POLARITY_NONINVERTED        0x00000000U             /*!< ETR is non-inverted, active at high level or rising edge */
#define DDL_TMR_ETR_POLARITY_INVERTED           TMR_SMCTRL_ETPOL        /*!< ETR is inverted, active at low level or falling edge */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_ETR_PRESCALER External Trigger Prescaler
  * @{
  */
#define DDL_TMR_ETR_PRESCALER_DIV1              0x00000000U                 /*!< ETR prescaler OFF */
#define DDL_TMR_ETR_PRESCALER_DIV2              TMR_SMCTRL_ETPCFG_0         /*!< ETR frequency is divided by 2 */
#define DDL_TMR_ETR_PRESCALER_DIV4              TMR_SMCTRL_ETPCFG_1         /*!< ETR frequency is divided by 4 */
#define DDL_TMR_ETR_PRESCALER_DIV8              TMR_SMCTRL_ETPCFG           /*!< ETR frequency is divided by 8 */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_ETR_FILTER External Trigger Filter
  * @{
  */
#define DDL_TMR_ETR_FILTER_FDIV1                0x00000000U                                                         /*!< No filter, sampling is done at fDTS */
#define DDL_TMR_ETR_FILTER_FDIV1_N2             TMR_SMCTRL_ETFCFG_0                                                 /*!< fSAMPLING=fCK_INT, N=2 */
#define DDL_TMR_ETR_FILTER_FDIV1_N4             TMR_SMCTRL_ETFCFG_1                                                 /*!< fSAMPLING=fCK_INT, N=4 */
#define DDL_TMR_ETR_FILTER_FDIV1_N8             (TMR_SMCTRL_ETFCFG_1 | TMR_SMCTRL_ETFCFG_0)                         /*!< fSAMPLING=fCK_INT, N=8 */
#define DDL_TMR_ETR_FILTER_FDIV2_N6             TMR_SMCTRL_ETFCFG_2                                                 /*!< fSAMPLING=fDTS/2, N=6 */
#define DDL_TMR_ETR_FILTER_FDIV2_N8             (TMR_SMCTRL_ETFCFG_2 | TMR_SMCTRL_ETFCFG_0)                         /*!< fSAMPLING=fDTS/2, N=8 */
#define DDL_TMR_ETR_FILTER_FDIV4_N6             (TMR_SMCTRL_ETFCFG_2 | TMR_SMCTRL_ETFCFG_1)                         /*!< fSAMPLING=fDTS/4, N=6 */
#define DDL_TMR_ETR_FILTER_FDIV4_N8             (TMR_SMCTRL_ETFCFG_2 | TMR_SMCTRL_ETFCFG_1 | TMR_SMCTRL_ETFCFG_0)   /*!< fSAMPLING=fDTS/4, N=8 */
#define DDL_TMR_ETR_FILTER_FDIV8_N6             TMR_SMCTRL_ETFCFG_3                                                 /*!< fSAMPLING=fDTS/8, N=8 */
#define DDL_TMR_ETR_FILTER_FDIV8_N8             (TMR_SMCTRL_ETFCFG_3 | TMR_SMCTRL_ETFCFG_0)                         /*!< fSAMPLING=fDTS/16, N=5 */
#define DDL_TMR_ETR_FILTER_FDIV16_N5            (TMR_SMCTRL_ETFCFG_3 | TMR_SMCTRL_ETFCFG_1)                         /*!< fSAMPLING=fDTS/16, N=6 */
#define DDL_TMR_ETR_FILTER_FDIV16_N6            (TMR_SMCTRL_ETFCFG_3 | TMR_SMCTRL_ETFCFG_1 | TMR_SMCTRL_ETFCFG_0)   /*!< fSAMPLING=fDTS/16, N=8 */
#define DDL_TMR_ETR_FILTER_FDIV16_N8            (TMR_SMCTRL_ETFCFG_3 | TMR_SMCTRL_ETFCFG_2)                         /*!< fSAMPLING=fDTS/16, N=5 */
#define DDL_TMR_ETR_FILTER_FDIV32_N5            (TMR_SMCTRL_ETFCFG_3 | TMR_SMCTRL_ETFCFG_2 | TMR_SMCTRL_ETFCFG_0)   /*!< fSAMPLING=fDTS/32, N=5 */
#define DDL_TMR_ETR_FILTER_FDIV32_N6            (TMR_SMCTRL_ETFCFG_3 | TMR_SMCTRL_ETFCFG_2 | TMR_SMCTRL_ETFCFG_1)   /*!< fSAMPLING=fDTS/32, N=6 */
#define DDL_TMR_ETR_FILTER_FDIV32_N8            TMR_SMCTRL_ETFCFG                                                   /*!< fSAMPLING=fDTS/32, N=8 */
/**
  * @}
  */


/** @defgroup TMR_DDL_EC_BREAK_POLARITY break polarity
  * @{
  */
#define DDL_TMR_BREAK_POLARITY_LOW              0x00000000U               /*!< Break input BRK is active low */
#define DDL_TMR_BREAK_POLARITY_HIGH             TMR_BDT_BRKPOL            /*!< Break input BRK is active high */
/**
  * @}
  */




/** @defgroup TMR_DDL_EC_OSSI OSSI
  * @{
  */
#define DDL_TMR_OSSI_DISABLE                    0x00000000U             /*!< When inactive, OCx/OCxN outputs are disabled */
#define DDL_TMR_OSSI_ENABLE                     TMR_BDT_IMOS            /*!< When inactive, OxC/OCxN outputs are first forced with their inactive level then forced to their idle level after the deadtime */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_OSSR OSSR
  * @{
  */
#define DDL_TMR_OSSR_DISABLE                    0x00000000U            /*!< When inactive, OCx/OCxN outputs are disabled */
#define DDL_TMR_OSSR_ENABLE                     TMR_BDT_RMOS           /*!< When inactive, OC/OCN outputs are enabled with their inactive level as soon as CCxE=1 or CCxNE=1 */
/**
  * @}
  */


