betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_tmr.h
/** @defgroup TMR_DDL_EC_DMABURST_BASEADDR DMA Burst Base Address
  * @{
  */
#define DDL_TMR_DMABURST_BASEADDR_CTRL1         0x00000000U                                                                             /*!< TMRx_CTRL1 register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CTRL2         TMR_DCTRL_DBADDR_0                                                                      /*!< TMRx_CTRL2 register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_SMCTRL        TMR_DCTRL_DBADDR_1                                                                      /*!< TMRx_SMCTRL register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_DIEN          (TMR_DCTRL_DBADDR_1 |  TMR_DCTRL_DBADDR_0)                                              /*!< TMRx_DIEN register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_STS           TMR_DCTRL_DBADDR_2                                                                      /*!< TMRx_STS register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CEG           (TMR_DCTRL_DBADDR_2 | TMR_DCTRL_DBADDR_0)                                               /*!< TMRx_CEG register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CCM1          (TMR_DCTRL_DBADDR_2 | TMR_DCTRL_DBADDR_1)                                               /*!< TMRx_CCM1 register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CCM2          (TMR_DCTRL_DBADDR_2 | TMR_DCTRL_DBADDR_1 | TMR_DCTRL_DBADDR_0)                          /*!< TMRx_CCM2 register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CCEN          TMR_DCTRL_DBADDR_3                                                                      /*!< TMRx_CCEN register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CNT           (TMR_DCTRL_DBADDR_3 | TMR_DCTRL_DBADDR_0)                                               /*!< TMRx_CNT register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_PSC           (TMR_DCTRL_DBADDR_3 | TMR_DCTRL_DBADDR_1)                                               /*!< TMRx_PSC register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_AUTORLD       (TMR_DCTRL_DBADDR_3 | TMR_DCTRL_DBADDR_1 | TMR_DCTRL_DBADDR_0)                          /*!< TMRx_AUTORLD register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_REPCNT        (TMR_DCTRL_DBADDR_3 | TMR_DCTRL_DBADDR_2)                                               /*!< TMRx_REPCNT register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CC1           (TMR_DCTRL_DBADDR_3 | TMR_DCTRL_DBADDR_2 | TMR_DCTRL_DBADDR_0)                          /*!< TMRx_CC1 register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CC2           (TMR_DCTRL_DBADDR_3 | TMR_DCTRL_DBADDR_2 | TMR_DCTRL_DBADDR_1)                          /*!< TMRx_CC2 register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CC3           (TMR_DCTRL_DBADDR_3 | TMR_DCTRL_DBADDR_2 | TMR_DCTRL_DBADDR_1 | TMR_DCTRL_DBADDR_0)     /*!< TMRx_CC3 register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_CC4           TMR_DCTRL_DBADDR_4                                                                      /*!< TMRx_CC4 register is the DMA base address for DMA burst */
#define DDL_TMR_DMABURST_BASEADDR_BDT           (TMR_DCTRL_DBADDR_4 | TMR_DCTRL_DBADDR_0)                                               /*!< TMRx_BDT register is the DMA base address for DMA burst */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_DMABURST_LENGTH DMA Burst Length
  * @{
  */
#define DDL_TMR_DMABURST_LENGTH_1TRANSFER       0x00000000U                                                                     /*!< Transfer is done to 1 register starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_2TRANSFERS      TMR_DCTRL_DBLEN_0                                                               /*!< Transfer is done to 2 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_3TRANSFERS      TMR_DCTRL_DBLEN_1                                                               /*!< Transfer is done to 3 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_4TRANSFERS      (TMR_DCTRL_DBLEN_1 |  TMR_DCTRL_DBLEN_0)                                        /*!< Transfer is done to 4 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_5TRANSFERS      TMR_DCTRL_DBLEN_2                                                               /*!< Transfer is done to 5 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_6TRANSFERS      (TMR_DCTRL_DBLEN_2 | TMR_DCTRL_DBLEN_0)                                         /*!< Transfer is done to 6 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_7TRANSFERS      (TMR_DCTRL_DBLEN_2 | TMR_DCTRL_DBLEN_1)                                         /*!< Transfer is done to 7 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_8TRANSFERS      (TMR_DCTRL_DBLEN_2 | TMR_DCTRL_DBLEN_1 | TMR_DCTRL_DBLEN_0)                     /*!< Transfer is done to 1 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_9TRANSFERS      TMR_DCTRL_DBLEN_3                                                               /*!< Transfer is done to 9 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_10TRANSFERS     (TMR_DCTRL_DBLEN_3 | TMR_DCTRL_DBLEN_0)                                         /*!< Transfer is done to 10 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_11TRANSFERS     (TMR_DCTRL_DBLEN_3 | TMR_DCTRL_DBLEN_1)                                         /*!< Transfer is done to 11 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_12TRANSFERS     (TMR_DCTRL_DBLEN_3 | TMR_DCTRL_DBLEN_1 | TMR_DCTRL_DBLEN_0)                     /*!< Transfer is done to 12 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_13TRANSFERS     (TMR_DCTRL_DBLEN_3 | TMR_DCTRL_DBLEN_2)                                         /*!< Transfer is done to 13 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_14TRANSFERS     (TMR_DCTRL_DBLEN_3 | TMR_DCTRL_DBLEN_2 | TMR_DCTRL_DBLEN_0)                     /*!< Transfer is done to 14 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_15TRANSFERS     (TMR_DCTRL_DBLEN_3 | TMR_DCTRL_DBLEN_2 | TMR_DCTRL_DBLEN_1)                     /*!< Transfer is done to 15 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_16TRANSFERS     (TMR_DCTRL_DBLEN_3 | TMR_DCTRL_DBLEN_2 | TMR_DCTRL_DBLEN_1 | TMR_DCTRL_DBLEN_0) /*!< Transfer is done to 16 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_17TRANSFERS     TMR_DCTRL_DBLEN_4                                                               /*!< Transfer is done to 17 registers starting from the DMA burst base address */
#define DDL_TMR_DMABURST_LENGTH_18TRANSFERS     (TMR_DCTRL_DBLEN_4 |  TMR_DCTRL_DBLEN_0)                                        /*!< Transfer is done to 18 registers starting from the DMA burst base address */
/**
  * @}
  */


/** @defgroup TMR_DDL_EC_TMR2_ITR1_RMP_TMR8  TMR2 Internal Trigger1 Remap TMR8
  * @{
  */
#define DDL_TMR_TMR2_ITR1_RMP_TMR8_TRGO    TMR2_OR_RMP_MASK                       /*!< TMR2_ITR1 is connected to TMR8_TRGO */
#define DDL_TMR_TMR2_ITR1_RMP_ETH_PTP      (TMR_OPT_RMPSEL_0 | TMR2_OR_RMP_MASK)  /*!< TMR2_ITR1 is connected to ETH_PTP */
#define DDL_TMR_TMR2_ITR1_RMP_OTG_FS_SOF   (TMR_OPT_RMPSEL_1 | TMR2_OR_RMP_MASK)  /*!< TMR2_ITR1 is connected to OTG_FS SOF */
#if defined(USB_OTG_HS)
#define DDL_TMR_TMR2_ITR1_RMP_OTG_HS_SOF   (TMR_OPT_RMPSEL | TMR2_OR_RMP_MASK)    /*!< TMR2_ITR1 is connected to OTG_HS SOF */
#endif /* USB_OTG_HS */
#if defined(USB_OTG_FS2)
#define DDL_TMR_TMR2_ITR1_RMP_OTG_FS2_SOF  (TMR_OPT_RMPSEL | TMR2_OR_RMP_MASK)    /*!< TMR2_ITR1 is connected to OTG_FS2 SOF */
#endif /* USB_OTG_FS2 */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_TMR5_TI4_RMP  TMR5 External Input Ch4 Remap
  * @{
  */
#define DDL_TMR_TMR5_TI4_RMP_GPIO        TMR5_OR_RMP_MASK                             /*!< TMR5 channel 4 is connected to GPIO */
#define DDL_TMR_TMR5_TI4_RMP_LSI         (TMR_OPT_TI4_RMPSEL_0 | TMR5_OR_RMP_MASK)    /*!< TMR5 channel 4 is connected to LSI internal clock */
#define DDL_TMR_TMR5_TI4_RMP_LSE         (TMR_OPT_TI4_RMPSEL_1 | TMR5_OR_RMP_MASK)    /*!< TMR5 channel 4 is connected to LSE */
#define DDL_TMR_TMR5_TI4_RMP_RTC         (TMR_OPT_TI4_RMPSEL | TMR5_OR_RMP_MASK)      /*!< TMR5 channel 4 is connected to RTC wakeup interrupt */
/**
  * @}
  */

/** @defgroup TMR_DDL_EC_TMR11_TI1_RMP  TMR11 External Input Capture 1 Remap
  * @{
  */
#define DDL_TMR_TMR11_TI1_RMP_GPIO        TMR11_OR_RMP_MASK                              /*!< TMR11 channel 1 is connected to GPIO */
#define DDL_TMR_TMR11_TI1_RMP_GPIO1       (TMR_OPT_TI1_RMPSEL_0 | TMR11_OR_RMP_MASK)     /*!< TMR11 channel 1 is connected to GPIO */
#define DDL_TMR_TMR11_TI1_RMP_GPIO2       (TMR_OPT_TI1_RMPSEL   | TMR11_OR_RMP_MASK)     /*!< TMR11 channel 1 is connected to GPIO */
#define DDL_TMR_TMR11_TI1_RMP_HSE_RTC     (TMR_OPT_TI1_RMPSEL_1 | TMR11_OR_RMP_MASK)     /*!< TMR11 channel 1 is connected to HSE_RTC */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup TMR_DDL_Exported_Macros TMR Exported Macros
  * @{
  */

/** @defgroup TMR_DDL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */
/**
  * @brief  Write a value in TMR register.
  * @param  __INSTANCE__ TMR Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define DDL_TMR_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG((__INSTANCE__)->__REG__, (__VALUE__))

/**
  * @brief  Read a value in TMR register.
  * @param  __INSTANCE__ TMR Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define DDL_TMR_ReadReg(__INSTANCE__, __REG__) READ_REG((__INSTANCE__)->__REG__)
/**
  * @}
  */

/** @defgroup TMR_DDL_EM_Exported_Macros Exported_Macros
  * @{
  */

/**
  * @brief  HELPER macro calculating DTG[0:7] in the TMRx_BDTR register to achieve the requested dead time duration.
  * @note ex: @ref __DDL_TMR_CALC_DEADTMRE (80000000, @ref DDL_TMR_GetClockDivision (), 120);
  * @param  __TMRCLK__ timer input clock frequency (in Hz)
  * @param  __CKD__ This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CLOCKDIVISION_DIV1
  *         @arg @ref DDL_TMR_CLOCKDIVISION_DIV2
  *         @arg @ref DDL_TMR_CLOCKDIVISION_DIV4
  * @param  __DT__ deadtime duration (in ns)
  * @retval DTG[0:7]
  */
#define __DDL_TMR_CALC_DEADTMRE(__TMRCLK__, __CKD__, __DT__)  \
  ( (((uint64_t)((__DT__)*1000U)) < ((DT_DELAY_1+1U) * TMR_CALC_DTS((__TMRCLK__), (__CKD__))))    ?  \
    (uint8_t)(((uint64_t)((__DT__)*1000U) / TMR_CALC_DTS((__TMRCLK__), (__CKD__)))  & DT_DELAY_1) :      \
    (((uint64_t)((__DT__)*1000U)) < ((64U + (DT_DELAY_2+1U)) * 2U * TMR_CALC_DTS((__TMRCLK__), (__CKD__))))  ?  \
    (uint8_t)(DT_RANGE_2 | ((uint8_t)((uint8_t)((((uint64_t)((__DT__)*1000U))/ TMR_CALC_DTS((__TMRCLK__),   \
                                                 (__CKD__))) >> 1U) - (uint8_t) 64) & DT_DELAY_2)) :\
    (((uint64_t)((__DT__)*1000U)) < ((32U + (DT_DELAY_3+1U)) * 8U * TMR_CALC_DTS((__TMRCLK__), (__CKD__))))  ?  \
    (uint8_t)(DT_RANGE_3 | ((uint8_t)((uint8_t)(((((uint64_t)(__DT__)*1000U))/ TMR_CALC_DTS((__TMRCLK__),  \
                                                 (__CKD__))) >> 3U) - (uint8_t) 32) & DT_DELAY_3)) :\
    (((uint64_t)((__DT__)*1000U)) < ((32U + (DT_DELAY_4+1U)) * 16U * TMR_CALC_DTS((__TMRCLK__), (__CKD__)))) ?  \
    (uint8_t)(DT_RANGE_4 | ((uint8_t)((uint8_t)(((((uint64_t)(__DT__)*1000U))/ TMR_CALC_DTS((__TMRCLK__),  \
                                                 (__CKD__))) >> 4U) - (uint8_t) 32) & DT_DELAY_4)) :\
    0U)

/**
  * @brief  HELPER macro calculating the prescaler value to achieve the required counter clock frequency.
  * @note ex: @ref __DDL_TMR_CALC_PSC (80000000, 1000000);
  * @param  __TMRCLK__ timer input clock frequency (in Hz)
  * @param  __CNTCLK__ counter clock frequency (in Hz)
  * @retval Prescaler value  (between Min_Data=0 and Max_Data=65535)
  */
#define __DDL_TMR_CALC_PSC(__TMRCLK__, __CNTCLK__)   \
  (((__TMRCLK__) >= (__CNTCLK__)) ? (uint32_t)((((__TMRCLK__) + (__CNTCLK__)/2U)/(__CNTCLK__)) - 1U) : 0U)

/**
  * @brief  HELPER macro calculating the auto-reload value to achieve the required output signal frequency.
  * @note ex: @ref __DDL_TMR_CALC_ARR (1000000, @ref DDL_TMR_GetPrescaler (), 10000);
  * @param  __TMRCLK__ timer input clock frequency (in Hz)
  * @param  __PSC__ prescaler
  * @param  __FREQ__ output signal frequency (in Hz)
  * @retval  Auto-reload value  (between Min_Data=0 and Max_Data=65535)
  */
#define __DDL_TMR_CALC_ARR(__TMRCLK__, __PSC__, __FREQ__) \
  ((((__TMRCLK__)/((__PSC__) + 1U)) >= (__FREQ__)) ? (((__TMRCLK__)/((__FREQ__) * ((__PSC__) + 1U))) - 1U) : 0U)

/**
  * @brief  HELPER macro calculating the compare value required to achieve the required timer output compare
  *         active/inactive delay.
  * @note ex: @ref __DDL_TMR_CALC_DELAY (1000000, @ref DDL_TMR_GetPrescaler (), 10);
  * @param  __TMRCLK__ timer input clock frequency (in Hz)
  * @param  __PSC__ prescaler
  * @param  __DELAY__ timer output compare active/inactive delay (in us)
  * @retval Compare value  (between Min_Data=0 and Max_Data=65535)
  */
#define __DDL_TMR_CALC_DELAY(__TMRCLK__, __PSC__, __DELAY__)  \
  ((uint32_t)(((uint64_t)(__TMRCLK__) * (uint64_t)(__DELAY__)) \
              / ((uint64_t)1000000U * (uint64_t)((__PSC__) + 1U))))

/**
  * @brief  HELPER macro calculating the auto-reload value to achieve the required pulse duration
  *         (when the timer operates in one pulse mode).
  * @note ex: @ref __DDL_TMR_CALC_PULSE (1000000, @ref DDL_TMR_GetPrescaler (), 10, 20);
  * @param  __TMRCLK__ timer input clock frequency (in Hz)
  * @param  __PSC__ prescaler
  * @param  __DELAY__ timer output compare active/inactive delay (in us)
  * @param  __PULSE__ pulse duration (in us)
  * @retval Auto-reload value  (between Min_Data=0 and Max_Data=65535)
  */
#define __DDL_TMR_CALC_PULSE(__TMRCLK__, __PSC__, __DELAY__, __PULSE__)  \
  ((uint32_t)(__DDL_TMR_CALC_DELAY((__TMRCLK__), (__PSC__), (__PULSE__)) \
              + __DDL_TMR_CALC_DELAY((__TMRCLK__), (__PSC__), (__DELAY__))))

/**
  * @brief  HELPER macro retrieving the ratio of the input capture prescaler
  * @note ex: @ref __DDL_TMR_GET_ICPSC_RATIO (@ref DDL_TMR_IC_GetPrescaler ());
  * @param  __ICPSC__ This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_ICPSC_DIV1
  *         @arg @ref DDL_TMR_ICPSC_DIV2
  *         @arg @ref DDL_TMR_ICPSC_DIV4
  *         @arg @ref DDL_TMR_ICPSC_DIV8
  * @retval Input capture prescaler ratio (1, 2, 4 or 8)
  */
#define __DDL_TMR_GET_ICPSC_RATIO(__ICPSC__)  \
  ((uint32_t)(0x01U << (((__ICPSC__) >> 16U) >> TMR_CCM1_IC1PSC_Pos)))


/**
  * @}
  */


/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup TMR_DDL_Exported_Functions TMR Exported Functions
  * @{
  */

