betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_tmr.h
/** @defgroup TMR_DDL_EF_Time_Base Time Base configuration
  * @{
  */
/**
  * @brief  Enable timer counter.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_EnableCounter(TMR_TypeDef *TMRx)
{
  SET_BIT(TMRx->CTRL1, TMR_CTRL1_CNTEN);
}

/**
  * @brief  Disable timer counter.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_DisableCounter(TMR_TypeDef *TMRx)
{
  CLEAR_BIT(TMRx->CTRL1, TMR_CTRL1_CNTEN);
}

/**
  * @brief  Indicates whether the timer counter is enabled.
  * @param  TMRx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_IsEnabledCounter(TMR_TypeDef *TMRx)
{
  return ((READ_BIT(TMRx->CTRL1, TMR_CTRL1_CNTEN) == (TMR_CTRL1_CNTEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable update event generation.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_EnableUpdateEvent(TMR_TypeDef *TMRx)
{
  CLEAR_BIT(TMRx->CTRL1, TMR_CTRL1_UD);
}

/**
  * @brief  Disable update event generation.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_DisableUpdateEvent(TMR_TypeDef *TMRx)
{
  SET_BIT(TMRx->CTRL1, TMR_CTRL1_UD);
}

/**
  * @brief  Indicates whether update event generation is enabled.
  * @param  TMRx Timer instance
  * @retval Inverted state of bit (0 or 1).
  */
__STATIC_INLINE uint32_t DDL_TMR_IsEnabledUpdateEvent(TMR_TypeDef *TMRx)
{
  return ((READ_BIT(TMRx->CTRL1, TMR_CTRL1_UD) == (uint32_t)RESET) ? 1UL : 0UL);
}

/**
  * @brief  Set update event source
  * @note Update event source set to DDL_TMR_UPDATESOURCE_REGULAR: any of the following events
  *       generate an update interrupt or DMA request if enabled:
  *        - Counter overflow/underflow
  *        - Setting the UG bit
  *        - Update generation through the slave mode controller
  * @note Update event source set to DDL_TMR_UPDATESOURCE_COUNTER: only counter
  *       overflow/underflow generates an update interrupt or DMA request if enabled.
  * @param  TMRx Timer instance
  * @param  UpdateSource This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_UPDATESOURCE_REGULAR
  *         @arg @ref DDL_TMR_UPDATESOURCE_COUNTER
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetUpdateSource(TMR_TypeDef *TMRx, uint32_t UpdateSource)
{
  MODIFY_REG(TMRx->CTRL1, TMR_CTRL1_URSSEL, UpdateSource);
}

/**
  * @brief  Get actual event update source
  * @param  TMRx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_UPDATESOURCE_REGULAR
  *         @arg @ref DDL_TMR_UPDATESOURCE_COUNTER
  */
__STATIC_INLINE uint32_t DDL_TMR_GetUpdateSource(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_BIT(TMRx->CTRL1, TMR_CTRL1_URSSEL));
}

/**
  * @brief  Set one pulse mode (one shot v.s. repetitive).
  * @param  TMRx Timer instance
  * @param  OnePulseMode This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_ONEPULSEMODE_SINGLE
  *         @arg @ref DDL_TMR_ONEPULSEMODE_REPETITIVE
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetOnePulseMode(TMR_TypeDef *TMRx, uint32_t OnePulseMode)
{
  MODIFY_REG(TMRx->CTRL1, TMR_CTRL1_SPMEN, OnePulseMode);
}

/**
  * @brief  Get actual one pulse mode.
  * @param  TMRx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_ONEPULSEMODE_SINGLE
  *         @arg @ref DDL_TMR_ONEPULSEMODE_REPETITIVE
  */
__STATIC_INLINE uint32_t DDL_TMR_GetOnePulseMode(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_BIT(TMRx->CTRL1, TMR_CTRL1_SPMEN));
}

/**
  * @brief  Set the timer counter counting mode.
  * @note Macro IS_TMR_COUNTER_MODE_SELECT_INSTANCE(TMRx) can be used to
  *       check whether or not the counter mode selection feature is supported
  *       by a timer instance.
  * @note Switching from Center Aligned counter mode to Edge counter mode (or reverse)
  *       requires a timer reset to avoid unexpected direction
  *       due to DIR bit readonly in center aligned mode.
  * @param  TMRx Timer instance
  * @param  CounterMode This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_COUNTERMODE_UP
  *         @arg @ref DDL_TMR_COUNTERMODE_DOWN
  *         @arg @ref DDL_TMR_COUNTERMODE_CENTER_UP
  *         @arg @ref DDL_TMR_COUNTERMODE_CENTER_DOWN
  *         @arg @ref DDL_TMR_COUNTERMODE_CENTER_UP_DOWN
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetCounterMode(TMR_TypeDef *TMRx, uint32_t CounterMode)
{
  MODIFY_REG(TMRx->CTRL1, (TMR_CTRL1_CNTDIR | TMR_CTRL1_CAMSEL), CounterMode);
}

/**
  * @brief  Get actual counter mode.
  * @note Macro IS_TMR_COUNTER_MODE_SELECT_INSTANCE(TMRx) can be used to
  *       check whether or not the counter mode selection feature is supported
  *       by a timer instance.
  * @param  TMRx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_COUNTERMODE_UP
  *         @arg @ref DDL_TMR_COUNTERMODE_DOWN
  *         @arg @ref DDL_TMR_COUNTERMODE_CENTER_UP
  *         @arg @ref DDL_TMR_COUNTERMODE_CENTER_DOWN
  *         @arg @ref DDL_TMR_COUNTERMODE_CENTER_UP_DOWN
  */
__STATIC_INLINE uint32_t DDL_TMR_GetCounterMode(TMR_TypeDef *TMRx)
{
  uint32_t counter_mode;

  counter_mode = (uint32_t)(READ_BIT(TMRx->CTRL1, TMR_CTRL1_CAMSEL));

  if (counter_mode == 0U)
  {
    counter_mode = (uint32_t)(READ_BIT(TMRx->CTRL1, TMR_CTRL1_CNTDIR));
  }

  return counter_mode;
}

/**
  * @brief  Enable auto-reload (ARR) preload.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_EnableARRPreload(TMR_TypeDef *TMRx)
{
  SET_BIT(TMRx->CTRL1, TMR_CTRL1_ARPEN);
}

/**
  * @brief  Disable auto-reload (ARR) preload.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_DisableARRPreload(TMR_TypeDef *TMRx)
{
  CLEAR_BIT(TMRx->CTRL1, TMR_CTRL1_ARPEN);
}

/**
  * @brief  Indicates whether auto-reload (ARR) preload is enabled.
  * @param  TMRx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_IsEnabledARRPreload(TMR_TypeDef *TMRx)
{
  return ((READ_BIT(TMRx->CTRL1, TMR_CTRL1_ARPEN) == (TMR_CTRL1_ARPEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the division ratio between the timer clock  and the sampling clock used by the dead-time generators
  *         (when supported) and the digital filters.
  * @note Macro IS_TMR_CLOCK_DIVISION_INSTANCE(TMRx) can be used to check
  *       whether or not the clock division feature is supported by the timer
  *       instance.
  * @param  TMRx Timer instance
  * @param  ClockDivision This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CLOCKDIVISION_DIV1
  *         @arg @ref DDL_TMR_CLOCKDIVISION_DIV2
  *         @arg @ref DDL_TMR_CLOCKDIVISION_DIV4
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetClockDivision(TMR_TypeDef *TMRx, uint32_t ClockDivision)
{
  MODIFY_REG(TMRx->CTRL1, TMR_CTRL1_CLKDIV, ClockDivision);
}

/**
  * @brief  Get the actual division ratio between the timer clock  and the sampling clock used by the dead-time
  *         generators (when supported) and the digital filters.
  * @note Macro IS_TMR_CLOCK_DIVISION_INSTANCE(TMRx) can be used to check
  *       whether or not the clock division feature is supported by the timer
  *       instance.
  * @param  TMRx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_CLOCKDIVISION_DIV1
  *         @arg @ref DDL_TMR_CLOCKDIVISION_DIV2
  *         @arg @ref DDL_TMR_CLOCKDIVISION_DIV4
  */
__STATIC_INLINE uint32_t DDL_TMR_GetClockDivision(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_BIT(TMRx->CTRL1, TMR_CTRL1_CLKDIV));
}

/**
  * @brief  Set the counter value.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @param  TMRx Timer instance
  * @param  Counter Counter value (between Min_Data=0 and Max_Data=0xFFFF or 0xFFFFFFFF)
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetCounter(TMR_TypeDef *TMRx, uint32_t Counter)
{
  WRITE_REG(TMRx->CNT, Counter);
}

/**
  * @brief  Get the counter value.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @param  TMRx Timer instance
  * @retval Counter value (between Min_Data=0 and Max_Data=0xFFFF or 0xFFFFFFFF)
  */
__STATIC_INLINE uint32_t DDL_TMR_GetCounter(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->CNT));
}

/**
  * @brief  Get the current direction of the counter
  * @param  TMRx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_COUNTERDIRECTION_UP
  *         @arg @ref DDL_TMR_COUNTERDIRECTION_DOWN
  */
__STATIC_INLINE uint32_t DDL_TMR_GetDirection(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_BIT(TMRx->CTRL1, TMR_CTRL1_CNTDIR));
}

/**
  * @brief  Set the prescaler value.
  * @note The counter clock frequency CK_CNT is equal to fCK_PSC / (PSC[15:0] + 1).
  * @note The prescaler can be changed on the fly as this control register is buffered. The new
  *       prescaler ratio is taken into account at the next update event.
  * @note Helper macro @ref __DDL_TMR_CALC_PSC can be used to calculate the Prescaler parameter
  * @param  TMRx Timer instance
  * @param  Prescaler between Min_Data=0 and Max_Data=65535
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetPrescaler(TMR_TypeDef *TMRx, uint32_t Prescaler)
{
  WRITE_REG(TMRx->PSC, Prescaler);
}

/**
  * @brief  Get the prescaler value.
  * @param  TMRx Timer instance
  * @retval  Prescaler value between Min_Data=0 and Max_Data=65535
  */
__STATIC_INLINE uint32_t DDL_TMR_GetPrescaler(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->PSC));
}

/**
  * @brief  Set the auto-reload value.
  * @note The counter is blocked while the auto-reload value is null.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Helper macro @ref __DDL_TMR_CALC_ARR can be used to calculate the AutoReload parameter
  * @param  TMRx Timer instance
  * @param  AutoReload between Min_Data=0 and Max_Data=65535
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetAutoReload(TMR_TypeDef *TMRx, uint32_t AutoReload)
{
  WRITE_REG(TMRx->AUTORLD, AutoReload);
}

/**
  * @brief  Get the auto-reload value.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @param  TMRx Timer instance
  * @retval Auto-reload value
  */
__STATIC_INLINE uint32_t DDL_TMR_GetAutoReload(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->AUTORLD));
}

/**
  * @brief  Set the repetition counter value.
  * @note Macro IS_TMR_REPETITION_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a repetition counter.
  * @param  TMRx Timer instance
  * @param  RepetitionCounter between Min_Data=0 and Max_Data=255 or 65535 for advanced timer.
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetRepetitionCounter(TMR_TypeDef *TMRx, uint32_t RepetitionCounter)
{
  WRITE_REG(TMRx->REPCNT, RepetitionCounter);
}

/**
  * @brief  Get the repetition counter value.
  * @note Macro IS_TMR_REPETITION_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a repetition counter.
  * @param  TMRx Timer instance
  * @retval Repetition counter value
  */
__STATIC_INLINE uint32_t DDL_TMR_GetRepetitionCounter(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->REPCNT));
}

/**
  * @}
  */

/** @defgroup TMR_DDL_EF_Capture_Compare Capture Compare configuration
  * @{
  */
/**
  * @brief  Enable  the capture/compare control bits (CCxE, CCxNE and OCxM) preload.
  * @note CCxE, CCxNE and OCxM bits are preloaded, after having been written,
  *       they are updated only when a commutation event (COM) occurs.
  * @note Only on channels that have a complementary output.
  * @note Macro IS_TMR_COMMUTATION_EVENT_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance is able to generate a commutation event.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_CC_EnablePreload(TMR_TypeDef *TMRx)
{
  SET_BIT(TMRx->CTRL2, TMR_CTRL2_CCPEN);
}

/**
  * @brief  Disable  the capture/compare control bits (CCxE, CCxNE and OCxM) preload.
  * @note Macro IS_TMR_COMMUTATION_EVENT_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance is able to generate a commutation event.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_CC_DisablePreload(TMR_TypeDef *TMRx)
{
  CLEAR_BIT(TMRx->CTRL2, TMR_CTRL2_CCPEN);
}

/**
  * @brief  Set the updated source of the capture/compare control bits (CCxE, CCxNE and OCxM).
  * @note Macro IS_TMR_COMMUTATION_EVENT_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance is able to generate a commutation event.
  * @param  TMRx Timer instance
  * @param  CCUpdateSource This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CCUPDATESOURCE_COMG_ONLY
  *         @arg @ref DDL_TMR_CCUPDATESOURCE_COMG_AND_TRGI
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_CC_SetUpdate(TMR_TypeDef *TMRx, uint32_t CCUpdateSource)
{
  MODIFY_REG(TMRx->CTRL2, TMR_CTRL2_CCUSEL, CCUpdateSource);
}

/**
  * @brief  Set the trigger of the capture/compare DMA request.
  * @param  TMRx Timer instance
  * @param  DMAReqTrigger This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CCDMAREQUEST_CC
  *         @arg @ref DDL_TMR_CCDMAREQUEST_UPDATE
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_CC_SetDMAReqTrigger(TMR_TypeDef *TMRx, uint32_t DMAReqTrigger)
{
  MODIFY_REG(TMRx->CTRL2, TMR_CTRL2_CCDSEL, DMAReqTrigger);
}

/**
  * @brief  Get actual trigger of the capture/compare DMA request.
  * @param  TMRx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_CCDMAREQUEST_CC
  *         @arg @ref DDL_TMR_CCDMAREQUEST_UPDATE
  */
__STATIC_INLINE uint32_t DDL_TMR_CC_GetDMAReqTrigger(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_BIT(TMRx->CTRL2, TMR_CTRL2_CCDSEL));
}

/**
  * @brief  Set the lock level to freeze the
  *         configuration of several capture/compare parameters.
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       the lock mechanism is supported by a timer instance.
  * @param  TMRx Timer instance
  * @param  LockLevel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_LOCKLEVEL_OFF
  *         @arg @ref DDL_TMR_LOCKLEVEL_1
  *         @arg @ref DDL_TMR_LOCKLEVEL_2
  *         @arg @ref DDL_TMR_LOCKLEVEL_3
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_CC_SetLockLevel(TMR_TypeDef *TMRx, uint32_t LockLevel)
{
  MODIFY_REG(TMRx->BDT, TMR_BDT_LOCKCFG, LockLevel);
}

/**
  * @brief  Enable capture/compare channels.
  * @param  TMRx Timer instance
  * @param  Channels This parameter can be a combination of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH1N
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH2N
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH3N
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_CC_EnableChannel(TMR_TypeDef *TMRx, uint32_t Channels)
{
  SET_BIT(TMRx->CCEN, Channels);
}

/**
  * @brief  Disable capture/compare channels.
  * @param  TMRx Timer instance
  * @param  Channels This parameter can be a combination of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH1N
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH2N
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH3N
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_CC_DisableChannel(TMR_TypeDef *TMRx, uint32_t Channels)
{
  CLEAR_BIT(TMRx->CCEN, Channels);
}

/**
  * @brief  Indicate whether channel(s) is(are) enabled.
  * @param  TMRx Timer instance
  * @param  Channels This parameter can be a combination of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH1N
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH2N
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH3N
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_CC_IsEnabledChannel(TMR_TypeDef *TMRx, uint32_t Channels)
{
  return ((READ_BIT(TMRx->CCEN, Channels) == (Channels)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup TMR_DDL_EF_Output_Channel Output channel configuration
  * @{
  */
/**
  * @brief  Configure an output channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @param  Configuration This parameter must be a combination of all the following values:
  *         @arg @ref DDL_TMR_OCPOLARITY_HIGH or @ref DDL_TMR_OCPOLARITY_LOW
  *         @arg @ref DDL_TMR_OCIDLESTATE_LOW or @ref DDL_TMR_OCIDLESTATE_HIGH
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_ConfigOutput(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t Configuration)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  CLEAR_BIT(*pReg, (TMR_CCM1_CC1SEL << SHIFT_TAB_OCxx[iChannel]));
  MODIFY_REG(TMRx->CCEN, (TMR_CCEN_CC1POL << SHIFT_TAB_CCxP[iChannel]),
             (Configuration & TMR_CCEN_CC1POL) << SHIFT_TAB_CCxP[iChannel]);
  MODIFY_REG(TMRx->CTRL2, (TMR_CTRL2_OC1OIS << SHIFT_TAB_OISx[iChannel]),
             (Configuration & TMR_CTRL2_OC1OIS) << SHIFT_TAB_OISx[iChannel]);
}

/**
  * @brief  Define the behavior of the output reference signal OCxREF from which
  *         OCx and OCxN (when relevant) are derived.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_OCMODE_FROZEN
  *         @arg @ref DDL_TMR_OCMODE_ACTIVE
  *         @arg @ref DDL_TMR_OCMODE_INACTIVE
  *         @arg @ref DDL_TMR_OCMODE_TOGGLE
  *         @arg @ref DDL_TMR_OCMODE_FORCED_INACTIVE
  *         @arg @ref DDL_TMR_OCMODE_FORCED_ACTIVE
  *         @arg @ref DDL_TMR_OCMODE_PWM1
  *         @arg @ref DDL_TMR_OCMODE_PWM2
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_SetMode(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t Mode)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  MODIFY_REG(*pReg, ((TMR_CCM1_OC1MOD  | TMR_CCM1_CC1SEL) << SHIFT_TAB_OCxx[iChannel]), Mode << SHIFT_TAB_OCxx[iChannel]);
}

/**
  * @brief  Get the output compare mode of an output channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_OCMODE_FROZEN
  *         @arg @ref DDL_TMR_OCMODE_ACTIVE
  *         @arg @ref DDL_TMR_OCMODE_INACTIVE
  *         @arg @ref DDL_TMR_OCMODE_TOGGLE
  *         @arg @ref DDL_TMR_OCMODE_FORCED_INACTIVE
  *         @arg @ref DDL_TMR_OCMODE_FORCED_ACTIVE
  *         @arg @ref DDL_TMR_OCMODE_PWM1
  *         @arg @ref DDL_TMR_OCMODE_PWM2
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_GetMode(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  return (READ_BIT(*pReg, ((TMR_CCM1_OC1MOD | TMR_CCM1_CC1SEL) << SHIFT_TAB_OCxx[iChannel])) >> SHIFT_TAB_OCxx[iChannel]);
}

/**
  * @brief  Set the polarity of an output channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH1N
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH2N
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH3N
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @param  Polarity This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_OCPOLARITY_HIGH
  *         @arg @ref DDL_TMR_OCPOLARITY_LOW
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_SetPolarity(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t Polarity)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  MODIFY_REG(TMRx->CCEN, (TMR_CCEN_CC1POL << SHIFT_TAB_CCxP[iChannel]),  Polarity << SHIFT_TAB_CCxP[iChannel]);
}

/**
  * @brief  Get the polarity of an output channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH1N
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH2N
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH3N
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_OCPOLARITY_HIGH
  *         @arg @ref DDL_TMR_OCPOLARITY_LOW
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_GetPolarity(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  return (READ_BIT(TMRx->CCEN, (TMR_CCEN_CC1POL << SHIFT_TAB_CCxP[iChannel])) >> SHIFT_TAB_CCxP[iChannel]);
}

/**
  * @brief  Set the IDLE state of an output channel
  * @note This function is significant only for the timer instances
  *       supporting the break feature. Macro IS_TMR_BREAK_INSTANCE(TMRx)
  *       can be used to check whether or not a timer instance provides
  *       a break input.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH1N
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH2N
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH3N
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @param  IdleState This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_OCIDLESTATE_LOW
  *         @arg @ref DDL_TMR_OCIDLESTATE_HIGH
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_SetIdleState(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t IdleState)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  MODIFY_REG(TMRx->CTRL2, (TMR_CTRL2_OC1OIS << SHIFT_TAB_OISx[iChannel]),  IdleState << SHIFT_TAB_OISx[iChannel]);
}

