betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_tmr.h
/**
  * @brief  Get the IDLE state of an output channel
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH1N
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH2N
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH3N
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_OCIDLESTATE_LOW
  *         @arg @ref DDL_TMR_OCIDLESTATE_HIGH
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_GetIdleState(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  return (READ_BIT(TMRx->CTRL2, (TMR_CTRL2_OC1OIS << SHIFT_TAB_OISx[iChannel])) >> SHIFT_TAB_OISx[iChannel]);
}

/**
  * @brief  Enable fast mode for the output channel.
  * @note Acts only if the channel is configured in PWM1 or PWM2 mode.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_EnableFast(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  SET_BIT(*pReg, (TMR_CCM1_OC1FEN << SHIFT_TAB_OCxx[iChannel]));

}

/**
  * @brief  Disable fast mode for the output channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_DisableFast(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  CLEAR_BIT(*pReg, (TMR_CCM1_OC1FEN << SHIFT_TAB_OCxx[iChannel]));

}

/**
  * @brief  Indicates whether fast mode is enabled for the output channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_IsEnabledFast(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  uint32_t bitfield = TMR_CCM1_OC1FEN << SHIFT_TAB_OCxx[iChannel];
  return ((READ_BIT(*pReg, bitfield) == bitfield) ? 1UL : 0UL);
}

/**
  * @brief  Enable compare register (TMRx_CCx) preload for the output channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_EnablePreload(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  SET_BIT(*pReg, (TMR_CCM1_OC1PEN << SHIFT_TAB_OCxx[iChannel]));
}

/**
  * @brief  Disable compare register (TMRx_CCx) preload for the output channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_DisablePreload(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  CLEAR_BIT(*pReg, (TMR_CCM1_OC1PEN << SHIFT_TAB_OCxx[iChannel]));
}

/**
  * @brief  Indicates whether compare register (TMRx_CCx) preload is enabled for the output channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_IsEnabledPreload(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  uint32_t bitfield = TMR_CCM1_OC1PEN << SHIFT_TAB_OCxx[iChannel];
  return ((READ_BIT(*pReg, bitfield) == bitfield) ? 1UL : 0UL);
}

/**
  * @brief  Enable clearing the output channel on an external event.
  * @note This function can only be used in Output compare and PWM modes. It does not work in Forced mode.
  * @note Macro IS_TMR_OCXREF_CLEAR_INSTANCE(TMRx) can be used to check whether
  *       or not a timer instance can clear the OCxREF signal on an external event.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_EnableClear(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  SET_BIT(*pReg, (TMR_CCM1_OC1CEN << SHIFT_TAB_OCxx[iChannel]));
}

/**
  * @brief  Disable clearing the output channel on an external event.
  * @note Macro IS_TMR_OCXREF_CLEAR_INSTANCE(TMRx) can be used to check whether
  *       or not a timer instance can clear the OCxREF signal on an external event.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_DisableClear(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  CLEAR_BIT(*pReg, (TMR_CCM1_OC1CEN << SHIFT_TAB_OCxx[iChannel]));
}

/**
  * @brief  Indicates clearing the output channel on an external event is enabled for the output channel.
  * @note This function enables clearing the output channel on an external event.
  * @note This function can only be used in Output compare and PWM modes. It does not work in Forced mode.
  * @note Macro IS_TMR_OCXREF_CLEAR_INSTANCE(TMRx) can be used to check whether
  *       or not a timer instance can clear the OCxREF signal on an external event.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_IsEnabledClear(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  uint32_t bitfield = TMR_CCM1_OC1CEN << SHIFT_TAB_OCxx[iChannel];
  return ((READ_BIT(*pReg, bitfield) == bitfield) ? 1UL : 0UL);
}

/**
  * @brief  Set the dead-time delay (delay inserted between the rising edge of the OCxREF signal and the rising edge of
  *         the Ocx and OCxN signals).
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       dead-time insertion feature is supported by a timer instance.
  * @note Helper macro @ref __DDL_TMR_CALC_DEADTMRE can be used to calculate the DeadTime parameter
  * @param  TMRx Timer instance
  * @param  DeadTime between Min_Data=0 and Max_Data=255
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_SetDeadTime(TMR_TypeDef *TMRx, uint32_t DeadTime)
{
  MODIFY_REG(TMRx->BDT, TMR_BDT_DTS, DeadTime);
}

/**
  * @brief  Set compare value for output channel 1 (TMRx_CC1).
  * @note In 32-bit timer implementations compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC1_INSTANCE(TMRx) can be used to check whether or not
  *       output channel 1 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @param  CompareValue between Min_Data=0 and Max_Data=65535
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_SetCompareCH1(TMR_TypeDef *TMRx, uint32_t CompareValue)
{
  WRITE_REG(TMRx->CC1, CompareValue);
}

/**
  * @brief  Set compare value for output channel 2 (TMRx_CC2).
  * @note In 32-bit timer implementations compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC2_INSTANCE(TMRx) can be used to check whether or not
  *       output channel 2 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @param  CompareValue between Min_Data=0 and Max_Data=65535
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_SetCompareCH2(TMR_TypeDef *TMRx, uint32_t CompareValue)
{
  WRITE_REG(TMRx->CC2, CompareValue);
}

/**
  * @brief  Set compare value for output channel 3 (TMRx_CC3).
  * @note In 32-bit timer implementations compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC3_INSTANCE(TMRx) can be used to check whether or not
  *       output channel is supported by a timer instance.
  * @param  TMRx Timer instance
  * @param  CompareValue between Min_Data=0 and Max_Data=65535
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_SetCompareCH3(TMR_TypeDef *TMRx, uint32_t CompareValue)
{
  WRITE_REG(TMRx->CC3, CompareValue);
}

/**
  * @brief  Set compare value for output channel 4 (TMRx_CC4).
  * @note In 32-bit timer implementations compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC4_INSTANCE(TMRx) can be used to check whether or not
  *       output channel 4 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @param  CompareValue between Min_Data=0 and Max_Data=65535
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_OC_SetCompareCH4(TMR_TypeDef *TMRx, uint32_t CompareValue)
{
  WRITE_REG(TMRx->CC4, CompareValue);
}

/**
  * @brief  Get compare value (TMRx_CC1) set for  output channel 1.
  * @note In 32-bit timer implementations returned compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC1_INSTANCE(TMRx) can be used to check whether or not
  *       output channel 1 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @retval CompareValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_GetCompareCH1(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->CC1));
}

/**
  * @brief  Get compare value (TMRx_CC2) set for  output channel 2.
  * @note In 32-bit timer implementations returned compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC2_INSTANCE(TMRx) can be used to check whether or not
  *       output channel 2 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @retval CompareValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_GetCompareCH2(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->CC2));
}

/**
  * @brief  Get compare value (TMRx_CC3) set for  output channel 3.
  * @note In 32-bit timer implementations returned compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC3_INSTANCE(TMRx) can be used to check whether or not
  *       output channel 3 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @retval CompareValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_GetCompareCH3(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->CC3));
}

/**
  * @brief  Get compare value (TMRx_CC4) set for  output channel 4.
  * @note In 32-bit timer implementations returned compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC4_INSTANCE(TMRx) can be used to check whether or not
  *       output channel 4 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @retval CompareValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t DDL_TMR_OC_GetCompareCH4(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->CC4));
}

/**
  * @}
  */

/** @defgroup TMR_DDL_EF_Input_Channel Input channel configuration
  * @{
  */
/**
  * @brief  Configure input channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @param  Configuration This parameter must be a combination of all the following values:
  *         @arg @ref DDL_TMR_ACTIVEINPUT_DIRECTTI or @ref DDL_TMR_ACTIVEINPUT_INDIRECTTI or @ref DDL_TMR_ACTIVEINPUT_TRC
  *         @arg @ref DDL_TMR_ICPSC_DIV1 or ... or @ref DDL_TMR_ICPSC_DIV8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV1 or ... or @ref DDL_TMR_IC_FILTER_FDIV32_N8
  *         @arg @ref DDL_TMR_IC_POLARITY_RISING or @ref DDL_TMR_IC_POLARITY_FALLING or @ref DDL_TMR_IC_POLARITY_BOTHEDGE
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_IC_Config(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t Configuration)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  MODIFY_REG(*pReg, ((TMR_CCM1_IC1F | TMR_CCM1_IC1PSC | TMR_CCM1_CC1SEL) << SHIFT_TAB_ICxx[iChannel]),
             ((Configuration >> 16U) & (TMR_CCM1_IC1F | TMR_CCM1_IC1PSC | TMR_CCM1_CC1SEL))                \
             << SHIFT_TAB_ICxx[iChannel]);
  MODIFY_REG(TMRx->CCEN, ((TMR_CCEN_CC1NPOL | TMR_CCEN_CC1POL) << SHIFT_TAB_CCxP[iChannel]),
             (Configuration & (TMR_CCEN_CC1NPOL | TMR_CCEN_CC1POL)) << SHIFT_TAB_CCxP[iChannel]);
}

/**
  * @brief  Set the active input.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @param  ICActiveInput This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_ACTIVEINPUT_DIRECTTI
  *         @arg @ref DDL_TMR_ACTIVEINPUT_INDIRECTTI
  *         @arg @ref DDL_TMR_ACTIVEINPUT_TRC
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_IC_SetActiveInput(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t ICActiveInput)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  MODIFY_REG(*pReg, ((TMR_CCM1_CC1SEL) << SHIFT_TAB_ICxx[iChannel]), (ICActiveInput >> 16U) << SHIFT_TAB_ICxx[iChannel]);
}

/**
  * @brief  Get the current active input.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_ACTIVEINPUT_DIRECTTI
  *         @arg @ref DDL_TMR_ACTIVEINPUT_INDIRECTTI
  *         @arg @ref DDL_TMR_ACTIVEINPUT_TRC
  */
__STATIC_INLINE uint32_t DDL_TMR_IC_GetActiveInput(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  return ((READ_BIT(*pReg, ((TMR_CCM1_CC1SEL) << SHIFT_TAB_ICxx[iChannel])) >> SHIFT_TAB_ICxx[iChannel]) << 16U);
}

/**
  * @brief  Set the prescaler of input channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @param  ICPrescaler This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_ICPSC_DIV1
  *         @arg @ref DDL_TMR_ICPSC_DIV2
  *         @arg @ref DDL_TMR_ICPSC_DIV4
  *         @arg @ref DDL_TMR_ICPSC_DIV8
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_IC_SetPrescaler(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t ICPrescaler)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  MODIFY_REG(*pReg, ((TMR_CCM1_IC1PSC) << SHIFT_TAB_ICxx[iChannel]), (ICPrescaler >> 16U) << SHIFT_TAB_ICxx[iChannel]);
}

/**
  * @brief  Get the current prescaler value acting on an  input channel.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_ICPSC_DIV1
  *         @arg @ref DDL_TMR_ICPSC_DIV2
  *         @arg @ref DDL_TMR_ICPSC_DIV4
  *         @arg @ref DDL_TMR_ICPSC_DIV8
  */
__STATIC_INLINE uint32_t DDL_TMR_IC_GetPrescaler(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  return ((READ_BIT(*pReg, ((TMR_CCM1_IC1PSC) << SHIFT_TAB_ICxx[iChannel])) >> SHIFT_TAB_ICxx[iChannel]) << 16U);
}

/**
  * @brief  Set the input filter duration.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @param  ICFilter This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV1
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV1_N2
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV1_N4
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV1_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV2_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV2_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV4_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV4_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV8_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV8_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV16_N5
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV16_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV16_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV32_N5
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV32_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV32_N8
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_IC_SetFilter(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t ICFilter)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  MODIFY_REG(*pReg, ((TMR_CCM1_IC1F) << SHIFT_TAB_ICxx[iChannel]), (ICFilter >> 16U) << SHIFT_TAB_ICxx[iChannel]);
}

/**
  * @brief  Get the input filter duration.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV1
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV1_N2
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV1_N4
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV1_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV2_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV2_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV4_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV4_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV8_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV8_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV16_N5
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV16_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV16_N8
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV32_N5
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV32_N6
  *         @arg @ref DDL_TMR_IC_FILTER_FDIV32_N8
  */
__STATIC_INLINE uint32_t DDL_TMR_IC_GetFilter(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&TMRx->CCM1) + OFFSET_TAB_CCMRx[iChannel]));
  return ((READ_BIT(*pReg, ((TMR_CCM1_IC1F) << SHIFT_TAB_ICxx[iChannel])) >> SHIFT_TAB_ICxx[iChannel]) << 16U);
}

/**
  * @brief  Set the input channel polarity.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @param  ICPolarity This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_IC_POLARITY_RISING
  *         @arg @ref DDL_TMR_IC_POLARITY_FALLING
  *         @arg @ref DDL_TMR_IC_POLARITY_BOTHEDGE
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_IC_SetPolarity(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t ICPolarity)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  MODIFY_REG(TMRx->CCEN, ((TMR_CCEN_CC1NPOL | TMR_CCEN_CC1POL) << SHIFT_TAB_CCxP[iChannel]),
             ICPolarity << SHIFT_TAB_CCxP[iChannel]);
}

