betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_tmr.h
/**
  * @brief  Get the current input channel polarity.
  * @param  TMRx Timer instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CHANNEL_CH1
  *         @arg @ref DDL_TMR_CHANNEL_CH2
  *         @arg @ref DDL_TMR_CHANNEL_CH3
  *         @arg @ref DDL_TMR_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_TMR_IC_POLARITY_RISING
  *         @arg @ref DDL_TMR_IC_POLARITY_FALLING
  *         @arg @ref DDL_TMR_IC_POLARITY_BOTHEDGE
  */
__STATIC_INLINE uint32_t DDL_TMR_IC_GetPolarity(TMR_TypeDef *TMRx, uint32_t Channel)
{
  uint8_t iChannel = TMR_GET_CHANNEL_INDEX(Channel);
  return (READ_BIT(TMRx->CCEN, ((TMR_CCEN_CC1NPOL | TMR_CCEN_CC1POL) << SHIFT_TAB_CCxP[iChannel])) >>
          SHIFT_TAB_CCxP[iChannel]);
}

/**
  * @brief  Connect the TMRx_CH1, CH2 and CH3 pins  to the TI1 input (XOR combination).
  * @note Macro IS_TMR_XOR_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides an XOR input.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_IC_EnableXORCombination(TMR_TypeDef *TMRx)
{
  SET_BIT(TMRx->CTRL2, TMR_CTRL2_TI1SEL);
}

/**
  * @brief  Disconnect the TMRx_CH1, CH2 and CH3 pins  from the TI1 input.
  * @note Macro IS_TMR_XOR_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides an XOR input.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_IC_DisableXORCombination(TMR_TypeDef *TMRx)
{
  CLEAR_BIT(TMRx->CTRL2, TMR_CTRL2_TI1SEL);
}

/**
  * @brief  Indicates whether the TMRx_CH1, CH2 and CH3 pins are connectected to the TI1 input.
  * @note Macro IS_TMR_XOR_INSTANCE(TMRx) can be used to check whether or not
  * a timer instance provides an XOR input.
  * @param  TMRx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_IC_IsEnabledXORCombination(TMR_TypeDef *TMRx)
{
  return ((READ_BIT(TMRx->CTRL2, TMR_CTRL2_TI1SEL) == (TMR_CTRL2_TI1SEL)) ? 1UL : 0UL);
}

/**
  * @brief  Get captured value for input channel 1.
  * @note In 32-bit timer implementations returned captured value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC1_INSTANCE(TMRx) can be used to check whether or not
  *       input channel 1 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t DDL_TMR_IC_GetCaptureCH1(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->CC1));
}

/**
  * @brief  Get captured value for input channel 2.
  * @note In 32-bit timer implementations returned captured value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC2_INSTANCE(TMRx) can be used to check whether or not
  *       input channel 2 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t DDL_TMR_IC_GetCaptureCH2(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->CC2));
}

/**
  * @brief  Get captured value for input channel 3.
  * @note In 32-bit timer implementations returned captured value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC3_INSTANCE(TMRx) can be used to check whether or not
  *       input channel 3 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t DDL_TMR_IC_GetCaptureCH3(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->CC3));
}

/**
  * @brief  Get captured value for input channel 4.
  * @note In 32-bit timer implementations returned captured value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TMR_32B_COUNTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports a 32 bits counter.
  * @note Macro IS_TMR_CC4_INSTANCE(TMRx) can be used to check whether or not
  *       input channel 4 is supported by a timer instance.
  * @param  TMRx Timer instance
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t DDL_TMR_IC_GetCaptureCH4(TMR_TypeDef *TMRx)
{
  return (uint32_t)(READ_REG(TMRx->CC4));
}

/**
  * @}
  */

/** @defgroup TMR_DDL_EF_Clock_Selection Counter clock selection
  * @{
  */
/**
  * @brief  Enable external clock mode 2.
  * @note When external clock mode 2 is enabled the counter is clocked by any active edge on the ETRF signal.
  * @note Macro IS_TMR_CLOCKSOURCE_ETRMODE2_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports external clock mode2.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_EnableExternalClock(TMR_TypeDef *TMRx)
{
  SET_BIT(TMRx->SMCTRL, TMR_SMCTRL_ECEN);
}

/**
  * @brief  Disable external clock mode 2.
  * @note Macro IS_TMR_CLOCKSOURCE_ETRMODE2_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports external clock mode2.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_DisableExternalClock(TMR_TypeDef *TMRx)
{
  CLEAR_BIT(TMRx->SMCTRL, TMR_SMCTRL_ECEN);
}

/**
  * @brief  Indicate whether external clock mode 2 is enabled.
  * @note Macro IS_TMR_CLOCKSOURCE_ETRMODE2_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports external clock mode2.
  * @param  TMRx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_IsEnabledExternalClock(TMR_TypeDef *TMRx)
{
  return ((READ_BIT(TMRx->SMCTRL, TMR_SMCTRL_ECEN) == (TMR_SMCTRL_ECEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the clock source of the counter clock.
  * @note when selected clock source is external clock mode 1, the timer input
  *       the external clock is applied is selected by calling the @ref DDL_TMR_SetTriggerInput()
  *       function. This timer input must be configured by calling
  *       the @ref DDL_TMR_IC_Config() function.
  * @note Macro IS_TMR_CLOCKSOURCE_ETRMODE1_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports external clock mode1.
  * @note Macro IS_TMR_CLOCKSOURCE_ETRMODE2_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports external clock mode2.
  * @param  TMRx Timer instance
  * @param  ClockSource This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_CLOCKSOURCE_INTERNAL
  *         @arg @ref DDL_TMR_CLOCKSOURCE_EXT_MODE1
  *         @arg @ref DDL_TMR_CLOCKSOURCE_EXT_MODE2
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetClockSource(TMR_TypeDef *TMRx, uint32_t ClockSource)
{
  MODIFY_REG(TMRx->SMCTRL, TMR_SMCTRL_SMFSEL | TMR_SMCTRL_ECEN, ClockSource);
}

/**
  * @brief  Set the encoder interface mode.
  * @note Macro IS_TMR_ENCODER_INTERFACE_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance supports the encoder mode.
  * @param  TMRx Timer instance
  * @param  EncoderMode This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_ENCODERMODE_X2_TI1
  *         @arg @ref DDL_TMR_ENCODERMODE_X2_TI2
  *         @arg @ref DDL_TMR_ENCODERMODE_X4_TI12
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetEncoderMode(TMR_TypeDef *TMRx, uint32_t EncoderMode)
{
  MODIFY_REG(TMRx->SMCTRL, TMR_SMCTRL_SMFSEL, EncoderMode);
}

/**
  * @}
  */

/** @defgroup TMR_DDL_EF_Timer_Synchronization Timer synchronisation configuration
  * @{
  */
/**
  * @brief  Set the trigger output (TRGO) used for timer synchronization .
  * @note Macro IS_TMR_MASTER_INSTANCE(TMRx) can be used to check
  *       whether or not a timer instance can operate as a master timer.
  * @param  TMRx Timer instance
  * @param  TimerSynchronization This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_TRGO_RESET
  *         @arg @ref DDL_TMR_TRGO_ENABLE
  *         @arg @ref DDL_TMR_TRGO_UPDATE
  *         @arg @ref DDL_TMR_TRGO_CC1IF
  *         @arg @ref DDL_TMR_TRGO_OC1REF
  *         @arg @ref DDL_TMR_TRGO_OC2REF
  *         @arg @ref DDL_TMR_TRGO_OC3REF
  *         @arg @ref DDL_TMR_TRGO_OC4REF
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetTriggerOutput(TMR_TypeDef *TMRx, uint32_t TimerSynchronization)
{
  MODIFY_REG(TMRx->CTRL2, TMR_CTRL2_MMSEL, TimerSynchronization);
}

/**
  * @brief  Set the synchronization mode of a slave timer.
  * @note Macro IS_TMR_SLAVE_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  * @param  TMRx Timer instance
  * @param  SlaveMode This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_SLAVEMODE_DISABLED
  *         @arg @ref DDL_TMR_SLAVEMODE_RESET
  *         @arg @ref DDL_TMR_SLAVEMODE_GATED
  *         @arg @ref DDL_TMR_SLAVEMODE_TRIGGER
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetSlaveMode(TMR_TypeDef *TMRx, uint32_t SlaveMode)
{
  MODIFY_REG(TMRx->SMCTRL, TMR_SMCTRL_SMFSEL, SlaveMode);
}

/**
  * @brief  Set the selects the trigger input to be used to synchronize the counter.
  * @note Macro IS_TMR_SLAVE_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  * @param  TMRx Timer instance
  * @param  TriggerInput This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_TS_ITR0
  *         @arg @ref DDL_TMR_TS_ITR1
  *         @arg @ref DDL_TMR_TS_ITR2
  *         @arg @ref DDL_TMR_TS_ITR3
  *         @arg @ref DDL_TMR_TS_TI1F_ED
  *         @arg @ref DDL_TMR_TS_TI1FP1
  *         @arg @ref DDL_TMR_TS_TI2FP2
  *         @arg @ref DDL_TMR_TS_ETRF
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetTriggerInput(TMR_TypeDef *TMRx, uint32_t TriggerInput)
{
  MODIFY_REG(TMRx->SMCTRL, TMR_SMCTRL_TRGSEL, TriggerInput);
}

/**
  * @brief  Enable the Master/Slave mode.
  * @note Macro IS_TMR_SLAVE_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_EnableMasterSlaveMode(TMR_TypeDef *TMRx)
{
  SET_BIT(TMRx->SMCTRL, TMR_SMCTRL_MSMEN);
}

/**
  * @brief  Disable the Master/Slave mode.
  * @note Macro IS_TMR_SLAVE_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_DisableMasterSlaveMode(TMR_TypeDef *TMRx)
{
  CLEAR_BIT(TMRx->SMCTRL, TMR_SMCTRL_MSMEN);
}

/**
  * @brief Indicates whether the Master/Slave mode is enabled.
  * @note Macro IS_TMR_SLAVE_INSTANCE(TMRx) can be used to check whether or not
  * a timer instance can operate as a slave timer.
  * @param  TMRx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_IsEnabledMasterSlaveMode(TMR_TypeDef *TMRx)
{
  return ((READ_BIT(TMRx->SMCTRL, TMR_SMCTRL_MSMEN) == (TMR_SMCTRL_MSMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the external trigger (ETR) input.
  * @note Macro IS_TMR_ETR_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides an external trigger input.
  * @param  TMRx Timer instance
  * @param  ETRPolarity This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_ETR_POLARITY_NONINVERTED
  *         @arg @ref DDL_TMR_ETR_POLARITY_INVERTED
  * @param  ETRPrescaler This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_ETR_PRESCALER_DIV1
  *         @arg @ref DDL_TMR_ETR_PRESCALER_DIV2
  *         @arg @ref DDL_TMR_ETR_PRESCALER_DIV4
  *         @arg @ref DDL_TMR_ETR_PRESCALER_DIV8
  * @param  ETRFilter This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV1
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV1_N2
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV1_N4
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV1_N8
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV2_N6
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV2_N8
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV4_N6
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV4_N8
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV8_N6
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV8_N8
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV16_N5
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV16_N6
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV16_N8
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV32_N5
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV32_N6
  *         @arg @ref DDL_TMR_ETR_FILTER_FDIV32_N8
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_ConfigETR(TMR_TypeDef *TMRx, uint32_t ETRPolarity, uint32_t ETRPrescaler,
                                      uint32_t ETRFilter)
{
  MODIFY_REG(TMRx->SMCTRL, TMR_SMCTRL_ETPOL | TMR_SMCTRL_ETPCFG | TMR_SMCTRL_ETFCFG, ETRPolarity | ETRPrescaler | ETRFilter);
}

/**
  * @}
  */

/** @defgroup TMR_DDL_EF_Break_Function Break function configuration
  * @{
  */
/**
  * @brief  Enable the break function.
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_EnableBRK(TMR_TypeDef *TMRx)
{
  __IO uint32_t tmpreg;
  SET_BIT(TMRx->BDT, TMR_BDT_BRKEN);
  /* Note: Any write operation to this bit takes a delay of 1 APB clock cycle to become effective. */
  tmpreg = READ_REG(TMRx->BDT);
  (void)(tmpreg);
}

/**
  * @brief  Disable the break function.
  * @param  TMRx Timer instance
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_DisableBRK(TMR_TypeDef *TMRx)
{
  __IO uint32_t tmpreg;
  CLEAR_BIT(TMRx->BDT, TMR_BDT_BRKEN);
  /* Note: Any write operation to this bit takes a delay of 1 APB clock cycle to become effective. */
  tmpreg = READ_REG(TMRx->BDT);
  (void)(tmpreg);
}

/**
  * @brief  Configure the break input.
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @param  TMRx Timer instance
  * @param  BreakPolarity This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_BREAK_POLARITY_LOW
  *         @arg @ref DDL_TMR_BREAK_POLARITY_HIGH
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_ConfigBRK(TMR_TypeDef *TMRx, uint32_t BreakPolarity)
{
  __IO uint32_t tmpreg;
  MODIFY_REG(TMRx->BDT, TMR_BDT_BRKPOL, BreakPolarity);
  /* Note: Any write operation to BKP bit takes a delay of 1 APB clock cycle to become effective. */
  tmpreg = READ_REG(TMRx->BDT);
  (void)(tmpreg);
}

/**
  * @brief  Select the outputs off state (enabled v.s. disabled) in Idle and Run modes.
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @param  TMRx Timer instance
  * @param  OffStateIdle This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_OSSI_DISABLE
  *         @arg @ref DDL_TMR_OSSI_ENABLE
  * @param  OffStateRun This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_OSSR_DISABLE
  *         @arg @ref DDL_TMR_OSSR_ENABLE
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetOffStates(TMR_TypeDef *TMRx, uint32_t OffStateIdle, uint32_t OffStateRun)
{
  MODIFY_REG(TMRx->BDT, TMR_BDT_IMOS | TMR_BDT_RMOS, OffStateIdle | OffStateRun);
}

/**
  * @brief  Enable automatic output (MOE can be set by software or automatically when a break input is active).
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_EnableAutomaticOutput(TMR_TypeDef *TMRx)
{
  SET_BIT(TMRx->BDT, TMR_BDT_AOEN);
}

/**
  * @brief  Disable automatic output (MOE can be set only by software).
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_DisableAutomaticOutput(TMR_TypeDef *TMRx)
{
  CLEAR_BIT(TMRx->BDT, TMR_BDT_AOEN);
}

/**
  * @brief  Indicate whether automatic output is enabled.
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @param  TMRx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_IsEnabledAutomaticOutput(TMR_TypeDef *TMRx)
{
  return ((READ_BIT(TMRx->BDT, TMR_BDT_AOEN) == (TMR_BDT_AOEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the outputs (set the MOE bit in TMRx_BDTR register).
  * @note The MOE bit in TMRx_BDTR register allows to enable /disable the outputs by
  *       software and is reset in case of break or break2 event
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_EnableAllOutputs(TMR_TypeDef *TMRx)
{
  SET_BIT(TMRx->BDT, TMR_BDT_MOEN);
}

/**
  * @brief  Disable the outputs (reset the MOE bit in TMRx_BDTR register).
  * @note The MOE bit in TMRx_BDTR register allows to enable /disable the outputs by
  *       software and is reset in case of break or break2 event.
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_DisableAllOutputs(TMR_TypeDef *TMRx)
{
  CLEAR_BIT(TMRx->BDT, TMR_BDT_MOEN);
}

/**
  * @brief  Indicates whether outputs are enabled.
  * @note Macro IS_TMR_BREAK_INSTANCE(TMRx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @param  TMRx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_IsEnabledAllOutputs(TMR_TypeDef *TMRx)
{
  return ((READ_BIT(TMRx->BDT, TMR_BDT_MOEN) == (TMR_BDT_MOEN)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup TMR_DDL_EF_DMA_Burst_Mode DMA burst mode configuration
  * @{
  */
/**
  * @brief  Configures the timer DMA burst feature.
  * @note Macro IS_TMR_DMABURST_INSTANCE(TMRx) can be used to check whether or
  *       not a timer instance supports the DMA burst mode.
  * @param  TMRx Timer instance
  * @param  DMABurstBaseAddress This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CTRL1
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CTRL2
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_SMCTRL
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_DIEN
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_SR
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_EGR
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CCM1
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CCM2
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CCEN
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CNT
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_PSC
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_AUTORLD
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_REPCNT
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CC1
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CC2
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CC3
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_CC4
  *         @arg @ref DDL_TMR_DMABURST_BASEADDR_BDT
  * @param  DMABurstLength This parameter can be one of the following values:
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_1TRANSFER
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_2TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_3TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_4TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_5TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_6TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_7TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_8TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_9TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_10TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_11TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_12TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_13TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_14TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_15TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_16TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_17TRANSFERS
  *         @arg @ref DDL_TMR_DMABURST_LENGTH_18TRANSFERS
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_ConfigDMABurst(TMR_TypeDef *TMRx, uint32_t DMABurstBaseAddress, uint32_t DMABurstLength)
{
  MODIFY_REG(TMRx->DCTRL, (TMR_DCTRL_DBLEN | TMR_DCTRL_DBADDR), (DMABurstBaseAddress | DMABurstLength));
}

/**
  * @}
  */

/** @defgroup TMR_DDL_EF_Timer_Inputs_Remapping Timer input remapping
  * @{
  */
/**
  * @brief  Remap TMR inputs (input channel, internal/external triggers).
  * @note Macro IS_TMR_REMAP_INSTANCE(TMRx) can be used to check whether or not
  *       a some timer inputs can be remapped.
  * @param  TMRx Timer instance
  * @param  Remap Remap param depends on the TMRx. Description available only
  *         in CHM version of the User Manual (not in .pdf).
  *         Otherwise see Reference Manual description of OR registers.
  *
  *         Below description summarizes "Timer Instance" and "Remap" param combinations:
  *
  *         TMR2: one of the following values
  *
  *            ITR1_RMP can be one of the following values
  *            @arg @ref DDL_TMR_TMR2_ITR1_RMP_TMR8_TRGO  (*)
  *            @arg @ref DDL_TMR_TMR2_ITR1_RMP_ETH_PTP
  *            @arg @ref DDL_TMR_TMR2_ITR1_RMP_OTG_FS_SOF (*)
  *            @arg @ref DDL_TMR_TMR2_ITR1_RMP_OTG_HS_SOF (*)
  *            @arg @ref DDL_TMR_TMR2_ITR1_RMP_OTG_FS2_SOF (*)
  *
  *         TMR5: one of the following values
  *
  *            @arg @ref DDL_TMR_TMR5_TI4_RMP_GPIO
  *            @arg @ref DDL_TMR_TMR5_TI4_RMP_LSI
  *            @arg @ref DDL_TMR_TMR5_TI4_RMP_LSE
  *            @arg @ref DDL_TMR_TMR5_TI4_RMP_RTC
  *
  *         TMR11: one of the following values
  *
  *            @arg @ref DDL_TMR_TMR11_TI1_RMP_GPIO
  *            @arg @ref DDL_TMR_TMR11_TI1_RMP_GPIO1 (*)
  *            @arg @ref DDL_TMR_TMR11_TI1_RMP_HSE_RTC
  *            @arg @ref DDL_TMR_TMR11_TI1_RMP_GPIO2
  *
  *         (*)  Value not defined in all devices. \n
  *
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_SetRemap(TMR_TypeDef *TMRx, uint32_t Remap)
{
  MODIFY_REG(TMRx->OPT, (Remap >> TMRx_OR_RMP_SHIFT), (Remap & TMRx_OR_RMP_MASK));
}

/**
  * @}
  */

/** @defgroup TMR_DDL_EF_FLAG_Management FLAG-Management
  * @{
  */
/**
  * @brief  Clear the update interrupt flag (UIF).
  * @param  TMRx Timer instance
  * @retval None
  */
__STATIC_INLINE void DDL_TMR_ClearFlag_UPDATE(TMR_TypeDef *TMRx)
{
  WRITE_REG(TMRx->STS, ~(TMR_STS_UIFLG));
}

/**
  * @brief  Indicate whether update interrupt flag (UIF) is set (update interrupt is pending).
  * @param  TMRx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_TMR_IsActiveFlag_UPDATE(TMR_TypeDef *TMRx)
{
  return ((READ_BIT(TMRx->STS, TMR_STS_UIFLG) == (TMR_STS_UIFLG)) ? 1UL : 0UL);
}

